{
  "aj-brown": {
    "isInjured": true,
    "injuryNote": "Aug 18: Brown (undisclosed) didn't participate in Tuesday's practice, Dave Zangaro of NBC Sports Philadelphia reports."
  },
  "alexander-mattison": {
    "isInjured": true,
    "injuryNote": "Aug 12: Mattison (neck), who was placed on season-ending IR on Monday, does not have a career-ending injury, David Furones of the South Florida Sun Sentinel reports."
  },
  "allen-lazard": {
    "isInjured": true,
    "injuryNote": "Aug 20: Lazard (shoulder) is day-to-day but did not practice Monday, Rich Cimini of ESPN.com reports."
  },
  "brandon-aiyuk": {
    "isInjured": true,
    "injuryNote": "Aug 19: Aiyuk (groin) did not participate in Sunday's practice, Nick Wagoner of ESPN.com reports."
  },
  "calvin-austin-iii": {
    "isInjured": true,
    "injuryNote": "Aug 14: Austin (ankle) did not participate in practice Wednesday, Brooke Pryor of ESPN.com reports."
  },
  "calvin-ridley": {
    "isInjured": true,
    "injuryNote": "Aug 20: Ridley (ankle) is sitting out of Tuesday's practice, Michael DiRocco of ESPN.com reports."
  },
  "chris-godwin": {
    "isInjured": true,
    "injuryNote": "Aug 18: Godwin (hamstring) missed Saturday's preseason game, Jenna Laine of ESPN.com reports."
  },
  "christian-watson": {
    "isInjured": true,
    "injuryNote": "Aug 12: Packers coach Matt LaFleur said Tuesday that Watson (knee) likely will begin the regular season on the PUP list but will be \"chomping at the bit\" to return, Matt Schneidman of The Athletic reports."
  },
  "curtis-samuel": {
    "isInjured": true,
    "injuryNote": "Aug 15: Samuel (hamstring) will be limited at practice Friday, Maddy Glab of the Bills' official site reports."
  },
  "dallas-goedert": {
    "isInjured": true,
    "injuryNote": "Aug 18: Goedert (ankle) was held out of practice Sunday, Tim McManus of ESPN.com reports."
  },
  "darnell-mooney": {
    "isInjured": true,
    "injuryNote": "Aug 12: Falcons coach Raheem Morris said Tuesday that he doesn't know when Mooney (shoulder) will return, but he's confident it will be this year, Josh Kendall of The Athletic reports."
  },
  "darren-waller": {
    "isInjured": true,
    "injuryNote": "Aug 18: Head coach Mike McDaniel said Monday that Waller (undisclosed) could begin practicing this week, David Furones of the South Florida Sun Sentinel reports."
  },
  "de-von-achane": {
    "isInjured": true,
    "injuryNote": "Aug 20: Achane (calf) didn't practice Wednesday, Marcel Louis-Jacques of ESPN.com reports."
  },
  "deandre-hopkins": {
    "isInjured": true,
    "injuryNote": "Aug 19: Hopkins (knee) is participating in practice Tuesday, Jonas Shaffer of TheBaltimoreBanner.com reports."
  },
  "devonta-smith": {
    "isInjured": true,
    "injuryNote": "Aug 18: Smith (ankle) is not practicing Saturday, Tim McManus of ESPN.com reports."
  },
  "devin-neal": {
    "isInjured": true,
    "injuryNote": "Aug 20: Neal (hamstring) didn't practice Monday, Matt Connolly of ESPN.com reports."
  },
  "dexter-lawrence-ii": {
    "isInjured": true,
    "injuryNote": "Aug 20: Lawrence (hamstring) is sitting out practice Monday, Jordan Raanan of ESPN.com reports."
  },
  "donald-parham-jr": {
    "isInjured": true,
    "injuryNote": "Aug 17: Parham (ankle) is not practicing Sunday, Kris Rhim of ESPN.com reports."
  },
  "drew-sanders": {
    "isInjured": true,
    "injuryNote": "Aug 3: Sanders (foot) underwent successful foot surgery earlier this week, Zac Stevens of TheDNVR.com reports."
  },
  "foster-moreau": {
    "isInjured": true,
    "injuryNote": "Aug 20: Moreau (ankle) was held out of Monday's practice, Katherine Terrell of ESPN.com reports."
  },
  "hollywood-brown": {
    "isInjured": true,
    "injuryNote": "Aug 18: Brown (ankle/foot) has resumed practicing, Matt McMullen of the Chiefs' official site reports."
  },
  "jj-russell": {
    "isInjured": true,
    "injuryNote": "Jul 25: Russell was placed in concussion protocol Friday, Tyler Drake of ArizonaSports.com reports."
  },
  "jt-gray": {
    "isInjured": true,
    "injuryNote": "Aug 20: Gray (hamstring) was limited at practice Monday, Katherine Terrell of ESPN.com reports."
  },
  "jaalin-conyers": {
    "isInjured": true,
    "injuryNote": "Aug 4: The Dolphins placed Conyers (leg) on injured reserve Monday."
  },
  "jalen-mcmillan": {
    "isInjured": true,
    "injuryNote": "Aug 20: McMillan (hamstring) was held out of Sunday's practice, Adam Jude of The Seattle Times reports."
  },
  "jayden-reed": {
    "isInjured": true,
    "injuryNote": "Aug 14: Reed (foot) is not wearing a walking boot at Thursday's practice, though he is not participating in on-field activities, Matt Schneidman of The Athletic reports."
  },
  "joey-porter-jr": {
    "isInjured": true,
    "injuryNote": "Aug 17: Porter (ankle) did not practice Friday, Brooke Pryor of ESPN.com reports."
  },
  "jordan-love": {
    "isInjured": true,
    "injuryNote": "Aug 18: Love (thumb) is participating in 7-on-7 drills at Monday's practice, Ryan Wood of USA Today reports."
  },
  "josh-downs": {
    "isInjured": true,
    "injuryNote": "Aug 21: Downs (hamstring) did not practice Wednesday, the Indianapolis Star reports."
  },
  "kareem-hunt": {
    "isInjured": true,
    "injuryNote": "Aug 13: Chiefs coach Andy Reid said Wednesday that Hunt (quadriceps) is dealing with a quad contusion and may not be available for Friday's preseason matchup against Seattle, Nate Taylor of ESPN.com reports."
  },
  "kendrick-bourne": {
    "isInjured": true,
    "injuryNote": "Aug 20: Bourne (knee) did not practice Tuesday, Mike Reiss of ESPN.com reports."
  },
  "khalil-shakir": {
    "isInjured": true,
    "injuryNote": "Aug 7: Bills head coach Sean McDermott said Thursday that Shakir (ankle) should be ready for the start of the regular season, Alaina Getzenberg of ESPN.com reports."
  },
  "kris-boyd": {
    "isInjured": true,
    "injuryNote": "Aug 20: Boyd (undisclosed) did not participate in Sunday's practice, Jamison Hensley of ESPN.com reports."
  },
  "ljarius-sneed": {
    "isInjured": true,
    "injuryNote": "Aug 20: Sneed (knee) was limited in Monday's practice, Adam Teicher of ESPN.com reports."
  },
  "malik-nabers": {
    "isInjured": true,
    "injuryNote": "Aug 20: Nabers (ankle) was limited at practice Monday, Jordan Raanan of ESPN.com reports."
  },
  "marshawn-lloyd": {
    "isInjured": true,
    "injuryNote": "Aug 17: Head coach Matt LaFleur told reporters Sunday that Lloyd \"is going to miss some time\" due to a hamstring injury that he suffered in Saturday's preseason game against the Colts, Rob Demovsky of ESPN.com reports."
  },
  "matthew-stafford": {
    "isInjured": true,
    "injuryNote": "Aug 19: Stafford (back) is dressed for practice Tuesday, Adam Grosbard of The Orange County Register reports."
  },
  "micah-parsons": {
    "isInjured": true,
    "injuryNote": "Aug 20: Cowboys head coach Brian Schottenheimer said \"I feel good about that, yeah\" when asked Wednesday whether he expects Parsons (back) to suit up Week 1 against the Eagles, Calvin Watkins of The Dallas Morning News reports."
  },
  "mike-gesicki": {
    "isInjured": true,
    "injuryNote": "Aug 20: Gesicki (hamstring) is nearing a return and might be able to play if the Bengals had a regular-season game coming up this weekend, Paul Dehner Jr. of The Athletic reports."
  },
  "najee-harris": {
    "isInjured": true,
    "injuryNote": "Aug 12: Harris (eye) participated in drills with a football Tuesday for the first time during training camp, Kris Rhim of ESPN.com reports."
  },
  "nick-bosa": {
    "isInjured": true,
    "injuryNote": "Aug 20: Bosa (hamstring) didn't practice Sunday, Nick Wagoner of ESPN.com reports."
  },
  "patrick-taylor-jr": {
    "isInjured": true,
    "injuryNote": "Aug 18: Taylor (ankle) did not participate in practice Friday, Rob Demovsky of ESPN.com reports."
  },
  "quentin-johnston": {
    "isInjured": true,
    "injuryNote": "Aug 16: Johnston (head) was carted off the field during Saturday's preseason game versus the Rams, Greg Beacham of the Associated Press reports."
  },
  "rachaad-white": {
    "isInjured": true,
    "injuryNote": "Aug 20: White (undisclosed) did not participate in practice Monday, Jenna Laine of ESPN.com reports."
  },
  "rashawn-slater": {
    "isInjured": true,
    "injuryNote": "Aug 9: The Chargers placed Slater (knee) on injured reserve Saturday."
  },
  "ronnie-rivers": {
    "isInjured": true,
    "injuryNote": "Aug 10: Rams head coach Sean McVay said Sunday that Rivers (ribs) will be out for \"a little bit of time,\" Greg Beacham of ESPN.com reports."
  },
  "rondale-moore": {
    "isInjured": true,
    "injuryNote": "Aug 20: Moore (ankle) was limited at practice Monday, Josh Weinfuss of ESPN.com reports."
  },
  "sam-darnold": {
    "isInjured": true,
    "injuryNote": "Aug 20: Darnold (shoulder) was limited in Tuesday's practice, Nick Wagoner of ESPN.com reports."
  },
  "samson-ebukam": {
    "isInjured": true,
    "injuryNote": "Aug 17: Ebukam (back) did not play in Saturday's preseason loss to Green Bay."
  },
  "savion-williams": {
    "isInjured": true,
    "injuryNote": "Aug 19: Williams (hamstring) is not practicing Tuesday, Wes Hodkiewicz of the Packers' official site reports."
  },
  "shedeur-sanders": {
    "isInjured": true,
    "injuryNote": "Aug 19: Sanders (oblique) isn't practicing but could return for Wednesday's session, Mary Kay Cabot of The Cleveland Plain Dealer reports."
  },
  "stefon-diggs": {
    "isInjured": true,
    "injuryNote": "Aug 18: Diggs (hamstring) was limited in Saturday's practice, Alaina Getzenberg of ESPN.com reports."
  },
  "tank-dell": {
    "isInjured": true,
    "injuryNote": "Jul 23: GM Nick Caserio acknowledged Wednesday that there's no timetable for the return of Dell (knee), who is on the active/PUP list, Jonathan M. Alexander of The Houston Chronicle reports."
  },
  "taysom-hill": {
    "isInjured": true,
    "injuryNote": "Aug 20: Hill (oblique) was limited in practice Monday, Katherine Terrell of ESPN.com reports."
  },
  "terrance-ferguson": {
    "isInjured": true,
    "injuryNote": "Aug 18: Ferguson (groin) participated in practice Monday, Cameron DaSilva of USA Today reports."
  },
  "tetairoa-mcmillan": {
    "isInjured": true,
    "injuryNote": "Aug 19: McMillan (hamstring) is not practicing Tuesday, Joe Person of The Athletic reports."
  },
  "tommy-tremble": {
    "isInjured": true,
    "injuryNote": "Aug 19: Panthers head coach Dave Canales said Tuesday that Tremble (back), who remains on the active/PUP list, is still on track to suit up for Week 1 but won't be a candidate to return in time for Thursday's preseason finale, David Newton of ESPN.com reports."
  },
  "tory-horton": {
    "isInjured": true,
    "injuryNote": "Aug 20: Horton (ankle) was limited in practice Monday, Michael DiRocco of ESPN.com reports."
  },
  "travis-hunter": {
    "isInjured": true,
    "injuryNote": "Aug 19: Hunter (upper body) remains day-to-day and may return for Thursday's joint practice with the Dolphins, Mia O'Brien of 1010 XL 92.5 FM Jacksonville reports."
  },
  "tyjae-spears": {
    "isInjured": true,
    "injuryNote": "Aug 18: Spears (ankle) was limited in practice Sunday, Turron Davenport of ESPN.com reports."
  },
  "tyler-bass": {
    "isInjured": true,
    "injuryNote": "Aug 15: Bills head coach Sean McDermott said Friday that Bass (pelvis) is \"moving in the right direction\" and hopes he'll be available for the team's preseason finale against Tampa Bay on Sat., Aug. 23, Katherine Fitzgerald of The Buffalo News reports."
  },
  "tyreek-hill": {
    "isInjured": true,
    "injuryNote": "Aug 20: Hill (oblique) is not practicing Wednesday, Omar Kelly of the Miami Herald reports."
  }
}